of7/capillaryRise/capillaryRiseSymWall/system/interfaceHeight
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      interfaceHeight;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


    type           interfaceHeight;
    libs           ("libfieldFunctionObjects.so");
    alpha          alpha.water;
                       // width x 0-0.001; height 0-0.02; depth z 0-0.001
    locations      (
                    (0       0 0.0005) //xMin wall
                    (0.00025 0 0.0005) //center
                    (0.0005  0 0.0005) //xMax symWall
                   );


    writeControl    adjustableRunTime; //writeTime;
    writeInterval   0.01; // this entry is needed for runTime/adjustableRunTime


// ************************************************************************* //
